test/nylon_ball_in_silicon_oil_tube_piso/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
  version         2.0;
  format          ascii;
  root            "";
  case            "";
  instance        "";
  local           "";
  class           dictionary;
  object          couplingProperties;
}

/* ---------------------------- sub-models & settings ---------------------------- */

modelType B; // A or B

couplingInterval 5;

allowUseSubCFDTimeStep false;

forceModels
(
  Archimedes
  DiFeliceDrag
);

momCoupleModels
(
  implicitCouple
);

voidFractionModel divided; // divided centre

locateModel engine;

meshMotionModel noMeshMotion;

dataExchangeModel twoWayMPI;

averagingModel dense; // dense dilute

turbulenceModelType turbulenceProperties;

/* ---------------------------- sub-model properties ------------------------- */

implicitCoupleProps
{
  velFieldName "U";
  granVelFieldName "Us";
  voidFractionFieldName "voidFraction";
}

DiFeliceDragProps
{
  velFieldName "U";
  granVelFieldName "Us";
  voidFractionFieldName "voidFraction";
  treatForceExplicitInMomEquation false;
  treatForceBothCFDAndDEM true;
  treatDEMForceImplicit false;
  verbose true;
  interpolation false;
  // scalarViscosity true;
  // nu [0 2 -1 0 0 0 0] 1e-04;
}

ArchimedesProps
{
  densityFieldName "rho";
  gravityFieldName "g";
}

twoWayMPIProps
{
  liggghtsPath "../DEM/in.liggghts_run";
}

dividedProps
{
  alphaMin 0.3;
  scaleUpVol 1.0;
}

centreProps
{
  alphaMin 0.30;
}

bigParticleProps
{
  maxCellsPerParticle 1000;
  alphaMin 0.30;
  scaleUpVol 1.0;
}

engineProps
{
  treeSearch false;
}
